api_facturacion/.xml

<?xml version="1.0"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
        <s:Body>
            <Registrar xmlns="http://tempuri.org/">
                <oGeneral xmlns:a="http://schemas.datacontract.org/2004/07/Libreria.XML.Facturacion" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
                    <a:Autenticacion>
                        <a:Clave>20100392403Qa</a:Clave>
                        <a:Ruc>20100392403</a:Ruc>
                    </a:Autenticacion>
                    <a:oENComprobante>
                        <a:CodigoCliente>10476802461</a:CodigoCliente>
                        <a:ComprobanteDetalle>
                            <a:ENComprobanteDetalle>
                                <a:Cantidad>1</a:Cantidad>
                                <a:CodigoProductoSunat>32101522</a:CodigoProductoSunat>
                                <a:CodigoTipoPrecio>01</a:CodigoTipoPrecio>
                                <a:ComprobanteDetalleImpuestos>
                                    <a:ENComprobanteDetalleImpuestos>
                                        <a:AfectacionIGV>10</a:AfectacionIGV>
                                        <a:CodigoTributo>1000</a:CodigoTributo>
                                        <a:CodigoUN>VAT</a:CodigoUN>
                                        <a:DesTributo>IGV</a:DesTributo>
                                        <a:ImporteExplicito>0.15</a:ImporteExplicito>
                                        <a:ImporteTributo>0.15</a:ImporteTributo>
                                        <a:MontoBase>0.85</a:MontoBase>
                                        <a:TasaAplicada>18</a:TasaAplicada>
                                    </a:ENComprobanteDetalleImpuestos>
                                </a:ComprobanteDetalleImpuestos>
                                <a:Descripcion>Producto 01</a:Descripcion>
                                <a:Determinante>1</a:Determinante>
                                <a:ImpuestoTotal>0.15</a:ImpuestoTotal>
                                <a:Item>1</a:Item>
                                <a:PrecioVentaItem>1.00</a:PrecioVentaItem>
                                <a:Total>0.85</a:Total>
                                <a:UnidadComercial>NIU</a:UnidadComercial>
                                <a:ValorVentaUnitario>0.85</a:ValorVentaUnitario>
                                <a:ValorVentaUnitarioIncIgv>1.00</a:ValorVentaUnitarioIncIgv>
                            </a:ENComprobanteDetalle>
                        </a:ComprobanteDetalle>
                    <a:ComprobanteMotivosDocumentos>
                       <a:ENComprobanteMotivoDocumento>
                          <a:CodigoMotivoEmision>04</a:CodigoMotivoEmision>
                          <a:NumeroDocRef>44</a:NumeroDocRef>
                          <a:SerieDocRef>FP20</a:SerieDocRef>
                         <a:Sustentos>
                            <a:ENComprobanteMotivoDocumentoSustento>
                              <a:Sustento>DESCUENTO TOTAL</a:Sustento>
                            </a:ENComprobanteMotivoDocumentoSustento>
                         </a:Sustentos>
                      </a:ENComprobanteMotivoDocumento>                                         
                    </a:ComprobanteMotivosDocumentos>               
                    <a:ComprobanteNotaCreditoDocRef>
                       <a:ENComprobanteNotaDocRef>
                          <a:FechaDocRef>2021-07-22</a:FechaDocRef>
                          <a:Numero>44</a:Numero>
                          <a:Serie>FP20</a:Serie>
                          <a:TipoComprobante>01</a:TipoComprobante>
                       </a:ENComprobanteNotaDocRef>
                    </a:ComprobanteNotaCreditoDocRef>               
                        <a:ComprobantePropiedadesAdicionales>
                            <a:ENComprobantePropiedadesAdicionales>
                                <a:Codigo>1000</a:Codigo>
                                <a:Valor/>
                            </a:ENComprobantePropiedadesAdicionales>
                        </a:ComprobantePropiedadesAdicionales>
                        <a:FechaEmision>2021-07-22</a:FechaEmision>
                        <a:FormaPago>
                            <a:ENFormaPago>
                                <a:CodigoFormaPago>001</a:CodigoFormaPago>
                                <a:DiasVencimiento>30</a:DiasVencimiento>
                                <a:FechaVencimiento>2021-08-22</a:FechaVencimiento>
                                <a:NotaInstruccion>CONTADO</a:NotaInstruccion>
                            </a:ENFormaPago>
                        </a:FormaPago>
                        <a:FormaPagoSunat>
                            <a:TipoFormaPago>1</a:TipoFormaPago>
                        </a:FormaPagoSunat>
                        <a:HoraEmision>11:20:30</a:HoraEmision>
                        <a:ImporteTotal>1.00</a:ImporteTotal>
                        <a:Moneda>PEN</a:Moneda>
                        <a:MontosTotales>
                            <a:Gravado>
                                <a:GravadoIGV>
                                    <a:Base>0.85</a:Base>
                                    <a:Porcentaje>18.00</a:Porcentaje>
                                    <a:ValorImpuesto>0.15</a:ValorImpuesto>
                                </a:GravadoIGV>
                            <a:Total>0.85</a:Total>
                            </a:Gravado>
                        </a:MontosTotales>  
                        <a:NrodePedido/>                           
                        <a:Numero>65</a:Numero>               
                        <a:RazonSocial>ALVARO MAURICIO ACOSTA SALAS</a:RazonSocial>
                        <a:Receptor>
                            <a:ENReceptor>
                                <a:Calle>JIRON FERROCARRIL 138</a:Calle>
                                <a:Codigo>150101</a:Codigo>
                                <a:CodPais>PE</a:CodPais>
                                <a:Departamento>Lima</a:Departamento>
                                <a:Distrito>Chorrillos</a:Distrito>
                                <a:Provincia>Lima</a:Provincia>
                            </a:ENReceptor>
                        </a:Receptor>
                        <a:Ruc>10476802461</a:Ruc>
                        <a:Serie>FN44</a:Serie>
                        <a:Sucursal>
                            <a:ENSucursal>
                                <a:Direccion>AV. DOS DE MAYO NRO. 647 PROV. CONST. DEL CALLAO</a:Direccion>
                                <a:Distrito>PROV. CONST. DEL CALLAO</a:Distrito>
                                <a:Provincia>PROV. CONST. DEL CALLAO</a:Provincia>
                                <a:Departamento>CALLAO</a:Departamento>
                            </a:ENSucursal>
                        </a:Sucursal>
                        <a:Texto>
                            <a:ENTexto>
                                <a:Texto1/>               
                                <a:Texto13/>                     
                                <a:Texto14/> 
                                <a:Texto2/>            
                            </a:ENTexto>
                        </a:Texto>
                        <a:TipoComprobante>07</a:TipoComprobante>
                        <a:TipoDocumentoIdentidad>6</a:TipoDocumentoIdentidad>
                        <a:TipoOperacion>0101</a:TipoOperacion>
                        <a:TotalImpuesto>0.15</a:TotalImpuesto>
                        <a:TotalPrecioVenta>1.00</a:TotalPrecioVenta>
                        <a:TotalValorVenta>0.85</a:TotalValorVenta>
                        <a:VersionUbl>2.1</a:VersionUbl>
                    </a:oENComprobante>
                    <a:oENEmpresa>
                        <a:Calle>AV. DOS DE MAYO NRO. 647 PROV. CONST. DEL CALLAO</a:Calle>
                        <a:CodDistrito>070101</a:CodDistrito>
                        <a:CodPais>PE</a:CodPais>
                        <a:CodigoEstablecimientoSUNAT>0000</a:CodigoEstablecimientoSUNAT>
                        <a:CodigoTipoDocumento>6</a:CodigoTipoDocumento>
                        <a:Correo>alvaro@gmail.com</a:Correo>
                        <a:Departamento>CALLAO</a:Departamento>
                        <a:Distrito>PROV. CONST. DEL CALLAO</a:Distrito>
                        <a:NombreComercial>ALDESA</a:NombreComercial>
                        <a:Provincia>PROV. CONST. DEL CALLAO</a:Provincia>
                        <a:RazonSocial>ALMACENES DE DEPOSITO S.A.C. ALDESA</a:RazonSocial>
                        <a:Ruc>20100392403</a:Ruc>
                        <a:Telefono>935829670</a:Telefono>
                        <a:Web>www.aacosta.com</a:Web>
                    </a:oENEmpresa>
                </oGeneral>
                <oTipoComprobante>NotaCredito</oTipoComprobante>
                <TipoCodigo>0</TipoCodigo>
                <Otorgar>1</Otorgar>
           </Registrar>
        </s:Body>
     </s:Envelope>
